{
    "assetDir": "D://Dev//Python//CRE Student Research//Assets",
    "devMode": 0,
    "tval": "D://Dev//Python//CRE Student Research//Assets",
    "winRes": [
        1920,
        1080
    ],
    "state_moves": ["++/+", "-/--", "-/--", "+/-", "+/-", "-/--"],
    "instructions_text": ["Welcome to the first part of the training!",
        "You will see 6 rectangles on the screen. You can move back and forth between any of the rectangles by pressing the 'U' or 'I' keys.",
        "One key goes through the middle, the other around the circle. You will have some time to try this out. Familiarize yourself with which key you have to press in order to get away from other rectangles.",
        "Below the rectangles there will be indicators denoted by pluses and minuses that show if you will gain or lose points. Two pluses or minuses indicate you will win or lose more. The indicators are separated by a '/'  on the left corresponds to pressing 'U' to go in a circle while the right corresponds with pressing 'I' to go across.",
        "Now it is time to practice!"],
    "continue_text": "press space to continue",
    "practice_text": ["press U or I to move",
        "Good, now press U to move",
        "Good, now press I to move",
        "err: timer not displayed",
        "Practice pressing U and I some more",
        "Practice using the U key more",
        "Practice using the I key more",
        "Good, now we will practice reaching a target\npress space when ready to continue",
        "Get to the red target in 2 moves",
        "Get to the red target in 1 moves",
        "Welcome to the second part of the training\npress space to continue",
        "Your goal now is to memorize how many points every move delivers\npress space to continue",
        "memorize how many points every move delivers",
        "Now try to get as many points as possible",
        "Now we will only show you tour score after you\n complete your entire turn of 2 moves\npress space to continue",
        "moves left",
        "Let's try a few exercises under time pressure!\nFrom now on you only have 9 seconds to think about it.\nYou then have about 2.5 seconds to enter the moves.\nThe thinking time can be interrupted by entering the first move.\nDo not enter the turn order until you have the entire sequence of moves planned out.",
        "moves left, time left",
        "you have completed the practice!"],
    "practice_time": 10,
    "practice_key_requirement": 10,
    "practice_target_2m": [[0,2], [0,4], [3,4], [2,2], [4,3]],
    "practice_target_1m": [[1,4], [5,2]],
    "practice_display_last": [1,2,3,4,5,6,11,12],
    "practice_display_total": [13],
    "practice_key_requirement2": 20,
    "points_requirement": 500,
    "successful_2moves": 10,
    "successful_timed": 10
}